<template>
  <div class="privacy-policy-page">
    <div class="container">

      <h3 class="privacy-policy-page__title">
        Загальні положення
      </h3>

      <p class="privacy-policy-page__info">
        Управління даними https://pcrexpress.net/ (далі – «Сайт») здійснюється ТОВ «PCREXPRESS» <br>
        Код ЄРДПОУ 134325, юридичною особою, яка зареєстрована і діє відповідно до вимог чинного законодавства України
        (далі – «Компанія»). <br>
        Компанія з великою повагою ставиться до конфіденційної (персональної) інформації всіх осіб, які відвідали Сайт і
        користуються сервісами сайту, в зв’язку з чим Компанія прагне захищати конфіденційність персональних даних
        (відомості чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути ідентифікована), тим
        самим створивши і забезпечивши максимально комфортні умови використання сервісів Сайту для кожного користувача.
        <br>
        Дана Політика конфіденційності та захисту персональних даних (далі – «Політика») встановлює порядок здійснення
        Компанією обробки персональних даних, види збираємих персональних даних, мету використання персональних даних,
        взаємодію Компанії з третіми особами, заходи безпеки для захисту персональних даних, умови доступу до
        персональних даних, а також контактну інформацію для користувача щодо отримання доступу, внесення змін,
        блокування або видалення своїх персональних даних та поводження з будь-якими питаннями, які можуть виникнути
        щодо захисту персональних даних.
      </p>

      <h3 class="privacy-policy-page__title">
        Збір та використання персональних даних
      </h3>

      <p class="privacy-policy-page__info p-second">
        Власником і розпорядником персональних даних користувачів Сайту є ТОВ «PCREXPRESS». <br>
        При використанні користувачем сервісів Сайту, Компанією здійснюється обробка даних користувача, а саме:
      </p>

      <ul class="privacy-policy-page__list">
        <li class="privacy-policy-page__item">
          Даних, що надаються користувачем при заповненні реєстраційних форм і в процесі користування
          інтернет-сервісами;
        </li>

        <li class="privacy-policy-page__item">
          файлів cookie;
        </li>

        <li class="privacy-policy-page__item">
          ір-адреси;
        </li>

        <li class="privacy-policy-page__item">
          параметрів і налаштувань інтернет-браузерів (User-agent)
        </li>
      </ul>

      <p class="privacy-policy-page__info p-third">
        Компанія збирає тільки ті персональні дані, які свідомо і добровільно надані користувачем як суб’єктом
        персональних даних в цілях використання сервісів Сайту, що відповідно до вимог законодавства є згодою суб’єкта
        персональних даних на обробку своїх персональних даних відповідно до сформульованої в цій Політиці метою їх
        обробки. <br>
        Компанія не збирає інформацію, щодо обробки якої законодавством встановлено певні вимоги: інформацію про расове
        або етнічне походження, про політичні, релігійні або світоглядні переконання, членство в політичних партіях та
        професійних спілках, засудження до кримінального покарання у скоєнні злочину або засудження до кримінального
        покарання, а також дані, що стосуються здоров’я, статевого життя, біометричних або генетичних даних (відповідно
        до статті 7 Закону України «Про захист персональних даних»).
      </p>

      <h3 class="privacy-policy-page__title">
        Обробка персональних даних
      </h3>

      <p class="privacy-policy-page__info p-third">
        Обробка і зберігання наданих персональних даних здійснюється в дата-центрах, де розміщується обладнання, що
        забезпечує функціонування сервісів Сайту.
      </p>

      <h3 class="privacy-policy-page__title">
        Цілі використання персональних даних
      </h3>

      <p class="privacy-policy-page__info p-fourth">
        Реєструючись на Сайті, користувач дає згоду на використання персональних даних.
      </p>

      <p class="privacy-policy-page__info p-fourth">
        Персональні дані користувача використовуються для забезпечення інтернет-сервісів Сайту (оформлення замовлення на
        товар). <br>
        Обробка наданої користувачем інформації здійснюється відповідно до чинного законодавства України. Зокрема,
        Компанія керується наступними нормативно-правовими актами: ЗУ «Про захист персональних даних», «Про ратифікацію
        Конвенції про захист осіб у зв’язку з автоматизованою обробкою персональних даних та Додаткового протоколу до
        Конвенції про захист осіб у зв’язку з автоматизованою обробкою персональних даних стосовно органів нагляду та
        транскордонних потоків даних», «Про інформацію», «Про рекламу», «Про захист інформації в
        інформаційно-телекомунікаційних системах».
      </p>

      <h3 class="privacy-policy-page__title">
        Термін зберігання персональних даних
      </h3>

      <p class="privacy-policy-page__info p-five">
        Персональні дані зберігаються протягом терміну, необхідного для надання інтернет-сервісів Сайту. Після того, як
        суб’єкт персональних даних перестає бути користувачем Сайту шляхом видалення свого облікового запису на Сайті,
        його персональні дані також автоматично видаляються.
      </p>

      <h3 class="privacy-policy-page__title">
        Використання файлів cookie
      </h3>

      <p class="privacy-policy-page__info p-six">
        Відповідно до класифікації Міжнародної торгової палати (International Chamber of Commerce), Компанія
        використовує такі категорії файлів cookie:
      </p>

      <ul class="privacy-policy-page__list ul-second">
        <li class="privacy-policy-page__item">
          Строго необхідні файли cookie (потрібні для переміщення користувачем по веб-сторінці і при користуванні
          сервісом доступу до реєстрації та авторизації, здійснення пошуку по Сайту. Також здійснюється запам’ятовування
          попередніх дій користувача при переході на попередню сторінку в тій же сесії).
        </li>

        <li class="privacy-policy-page__item">
          Експлуатаційні файли cookie (агрегують інформацію про те, як використовується Сайт. <br> Ці дані зберігаються
          на пристрої користувача між сеансами веб-браузера).
        </li>

        <li class="privacy-policy-page__item">
          Функціональні файли cookie (використовуються для збереження параметрів змін, які зберігаються на пристрої
          користувача між <br class="br-li-mob"> сеансами веб-браузера: ім’я користувача, фото в профілі, мова сайту, місцезнаходження, а
          також інші параметри налаштування <br class="br-li-mob"> Сайту). Дані файли cookie також дозволяють користувачам дивитися відео і
          взаємодіяти з соціальними мережами.
        </li>

        <li class="privacy-policy-page__item">
          Cookie-файли сторонніх сервісів і сервісів аналітики: (для більш якісного відображення контенту і його
          детального аналізу на <br class="br-li-mob"> Сайті, Компанія користується послугами, які є власністю інших сторонніх компаній,
          таких
          як Facebook, Google).
        </li>
      </ul>

      <p class="privacy-policy-page__info">
        Сторонні компанії можуть використовувати файли cookie на пристрої користувача, під час роботи на Сайті. Сайт не
        може вплинути на роботу файлів cookie, які використовуються сторонніми сервісами. Всі необхідні відомості про їх
        використання можна дізнатися, відвідавши відповідний ресурс.
        Інформація про користувачів, отримана за допомогою файлів cookie, не продається і не поширюється у відкритому
        доступі, а також є власністю Компанії, якій належить ресурс.
      </p>

      <h3 class="privacy-policy-page__title h-second">
        Взаємодія Компанії з третіми особами стосовно персональних даних
      </h3>

      <p class="privacy-policy-page__info p-seven">
        Компанія не здійснює передачу персональних даних третім особам, крім випадків, коли така передача є вимогою
        законодавства, на прохання суб’єкта персональних даних або в інших випадках, викладених в даній Політиці.
        ТОВ «PCREXPRESS» не передає персональну інформацію користувачів третім особам, за винятком:
      </p>

      <ul class="privacy-policy-page__list ul-second">
        <li class="privacy-policy-page__item">
          Здійснення поштової або кур’єрської доставки товару користувачеві. В даному випадку інформація <br class="br-li-mob"> надається
          поштовій сервісній або кур’єрській службі для здійснення доставки товару користувачеві.
        </li>

        <li class="privacy-policy-page__item">
          Повернення коштів за товар користувачеві. В даному випадку інформація надається <br class="br-li-mob"> фінансовим установам для
          здійснення повернення коштів користувачеві.
        </li>
      </ul>

      <p class="privacy-policy-page__info">
        На Сайті можуть бути посилання на інші веб-сайти. При переході по посиланню на інші веб-сайти дія цієї Політики
        на такі сайти не поширюватиметься.
      </p>

      <h3 class="privacy-policy-page__title">
        Конфіденційність активності суб’єкта персональних даних на Сайті
      </h3>

      <p class="privacy-policy-page__info p-eight">
        Відомості про активність (трафік) на Сайті користувачів, які проходять через мережу, або електронну пошту
        користувача захищені відповідно до законодавства. Тобто, Компанія жодним чином або способом не порушує таємницю
        «активності» користувача при використанні сервісів Сайту.
      </p>

      <h3 class="privacy-policy-page__title">
        Захист персональних даних
      </h3>

      <p class="privacy-policy-page__info p-third">
        Компанія збирає тільки ті персональні дані, які свідомо і добровільно надані користувачем як суб’єктом
        персональних даних в цілях використання сервісів Сайту, що відповідно до вимог законодавства є згодою суб’єкта
        персональних даних на обробку своїх персональних даних відповідно до сформульованої в цій Політиці метою їх
        обробки. <br>
        Компанія не збирає інформацію, щодо обробки якої законодавством встановлено певні вимоги: інформацію про расове
        або етнічне походження, про політичні, релігійні або світоглядні переконання, членство в політичних партіях та
        професійних спілках, засудження до кримінального покарання у скоєнні злочину або засудження до кримінального
        покарання, а також дані, що стосуються здоров’я, статевого життя, біометричних або генетичних даних (відповідно
        до статті 7 Закону України «Про захист персональних даних»).
      </p>

      <h3 class="privacy-policy-page__title">
        Умови доступу до персональних даних
      </h3>

      <p class="privacy-policy-page__info">
        Порядок доступу до персональних даних третіх осіб визначається умовами згоди користувача, наданї
        власникомперсональних даних на обробку цих даних і відповідно до чинного законодавства України. <br>
        Користувач має право на отримання будь-яких відомостей про себе у будь-якого суб’єкта відносин, пов’язаних із
        персональними даними, за умови зазначення прізвища, імені та по батькові, місця проживання (місця перебування)
        та реквізитів документа, що посвідчує фізичну особу, яка подає запит, крім випадків, встановлених законом. <br>
        Доступ користувача до даних про себе здійснюється безоплатно. <br>
        Відстрочка доступу користувача до своїх персональних даних не допускається. <br>
        Відстрочка доступу до персональних даних третіх осіб допускається у разі, якщо необхідні дані не можуть бути
        надані протягом тридцяти календарних днів з дня надходження запиту. При цьому загальний термін вирішення питань,
        порушених у запиті, не може перевищувати сорока п’яти календарних днів. <br>
        Повідомлення про відстрочку доводиться до відома третьої особи, яка подала запит, у письмовій формі з
        роз’ясненням порядку оскарження такого рішення.
        Рішення про відстрочення або відмову в доступі до персональних даних може бути оскаржено до Уповноваженого
        Верховної Ради України з прав людини або через суд.
      </p>


      <h3 class="privacy-policy-page__title">
        Зміна Політики
      </h3>

      <p class="privacy-policy-page__info p-second">
        У цю Політику періодично і без попереднього повідомлення користувача можуть вноситися зміни і доповнення, в тому числі, при зміні чинного законодавства.
        Просимо час від часу переглядати Політику для того, щоб бути в курсі змін і доповнень.
      </p>

    </div>
  </div>
</template>

<script>
export default {
  name: "PrivacyPolicyPage"
}
</script>

<style lang="scss" scoped>
.privacy-policy-page {
  padding: 65px 0;
  font-family: 'Roboto', sans-serif;

  &__title {
    font-weight: 500;
    font-size: 36px;
    line-height: 42px;
    color: #313131;
    text-align: center;
    margin-bottom: 65px;
  }

  &__info {
    font-size: 18px;
    line-height: 35px;
    color: #000000;
    margin-bottom: 100px;
  }

  .p-second {
    line-height: 45px;
    margin-bottom: 85px;
  }

  &__list {
    margin-bottom: 85px;
    font-size: 21px;
    line-height: 25px;
    color: #000000;
  }

  &__item {
    padding-left: 37px;
    background-image: url("../assets/icons/list-marker.png");
    background-size: inherit;
    background-repeat: no-repeat;
    background-position: left top;
  }

  &__item + &__item {
    margin-top: 57px;
  }

  .p-third {
    line-height: 45px;
  }

  .p-fourth {
    width: 1211px;
    line-height: 35px;
    margin-bottom: 65px;
  }

  .p-five {
    width: 1211px;
    line-height: 35px;
  }

  .p-six {
    line-height: 21px;
    margin-bottom: 65px;
  }

  .ul-second {
    margin-bottom: 65px;
    line-height: 35px;
  }

  .p-seven {
    width: 978px;
    margin-bottom: 60px;
  }

  .p-eight {
    margin-bottom: 155px;
  }
}

@media (max-width: 428px) {
  .privacy-policy-page {
    padding: 4px 0 70px;

    &__title {
      font-size: 17px;
      line-height: 20px;
      margin-bottom: 22px;
    }

    &__info,
    .p-third {
      font-weight: 300;
      font-size: 15px;
      line-height: 22px;
      margin-bottom: 50px;
    }

    .p-second {
      line-height: 22px;
      margin-bottom: 30px;
    }

    &__list {
      margin-bottom: 30px;
      font-weight: 300;
      font-size: 14px;
      line-height: 22px;
    }

    &__item {
      padding-left: 16px;
      background-size: 8px 8px;
      background-position: left 7px;
    }

    &__item + &__item {
      margin-top: 16px;
    }

    .p-fourth {
      width: auto;
      line-height: 22px;
      margin-bottom: 30px;
    }

    .p-five {
      width: auto;
      line-height: 22px;
    }

    .p-six {
      font-weight: normal;
      line-height: 22px;
      margin-bottom: 31px;
    }

    .ul-second {
      margin-bottom: 23px;
      line-height: 22px;
    }

    .br-li-mob {
      display: none;
    }

    .h-second {
      width: 262px;
      margin: 0 auto 22px;
    }

    .p-seven {
      width: auto;
      margin-bottom: 30px;
      font-weight: normal;
    }

    .p-eight {
      margin-bottom: 53px;
    }
  }
}

@media (max-width: 390px) {
  .privacy-policy-page {
    padding: 4px 0 30px;

    &__title {
      font-size: 15px;
      line-height: 18px;
      margin-bottom: 20px;
    }

    &__info {
      font-size: 14px;
      line-height: 20px;
      margin-bottom: 48px;
    }

    .p-second {
      line-height: 20px;
      margin-bottom: 28px;
    }

    &__list {
      margin-bottom: 48px;
      font-size: 13px;
      line-height: 20px;
    }

    &__item {
      padding-left: 14px;
      background-size: 8px 8px;
      background-position: left 6px;
    }

    &__item + &__item {
      margin-top: 15px;
    }

    .p-third {
      line-height: 20px;
    }

    .p-fourth {
      line-height: 20px;
      margin-bottom: 28px;
    }

    .p-five {
      line-height: 20px;
    }

    .p-six {
      line-height: 20px;
      margin-bottom: 28px;
    }

    .ul-second {
      margin-bottom: 21px;
      line-height: 20px;
    }

    .h-second {
      width: 238px;
      margin: 0 auto 20px;
    }

    .p-seven {
      margin-bottom: 28px;
    }

    .p-eight {
      margin-bottom: 48px;
    }
  }
}
</style>